posts/kde_fcitx_emacs.org
#+title: Gentoo 安装问题记录
#+filetags: kde fcitx emacs

  本来周末想写下最近关于「编译期计算」的一些零碎的想法，结果家里的 debian 升级后挂掉了，我才知道自己原来一直使用的是 /sid/ 分支。

然后周末就把系统换回 gentoo 了，和以前一样，安装中遇见了些问题，有些一下都没想起来为什么，浪费了些时间，进行下记录，下次也好方便排查。

* 镜像

  [[https://mirrors.tuna.tsinghua.edu.cn/git/gentoo-portage.git][清华大学的 git 镜像]]是速度最快的，使用 /mirrorselect/ 会选择到清华大学的 /rsync/ 镜像

* 字体

  没安装中文字体前, 中文都会显示为「tofu」, 开源中文字体除了传统的「文泉驿」外，还有「思源」、「花园明体」、「霞鹜文楷」，
  「霞鹜文楷」目前来看最美观

* KDE
  KDE 的问题是，安装后 /ssdm/ 是没有安装的，不知道为什么这次会是这样，重启后直接进入了终端，导致我怀疑是没有安装成功

  另外一个问题就是，不但 /ssdm/ 没有安装，其他什么 KDE 的 APP 都没安装，只有个 KDE WM, 很奇怪，需要自己手动安装

* Fcitx

** 各个包的用途
   1. =app-i18n/fcitx= 框架
   2. =app-i18n/kcm-fcitx= 配置工具

      没有这个包的话，是无法从图形界面进行配置的
   3. =app-i18n/fcitx-qt5=

      这个包必须安装，否则在所有 QT5 的 APP 里面，都是不能激活 fcitx 的

** xprofile 配置
   需要在 ~/.xprofile 中加入下面的设置，然后重新登录才能使用 fcitx
   #+BEGIN_SRC bash
     export XMODIFIERS=@im=fcitx
     export GTK_IM_MODULE=fcitx
     export QT_IM_MODULE=fcitxf
   #+END_SRC

* Emacs

** 无法激活 fcitx

   这个有两个原因:
   1. fcitx 的激活快捷键和 emacs 本身的快捷键有冲突，修改其中任意一个对应的快捷键就行
   2. emacs 找不到合适的字体时，是不会激活输入法的，也不会有任意提示，安装 =media-fonts/font-util= 这个包就行

** 可以激活和使用 fcitx, 但是输入的文字不会出现在 buffer 里

   emacs 中 im 和 *LC_CTYPE* 有关，如果不是 *zh_CN.UTF8* 是无法输入中文的，似乎是一个 Bug 来着，可以直接把 locale
   设置为 /zh_CN.UTF8/，也可以通过 =LC_CTYPE=zh_CN.UTF8 emacs= 的方式来启动

** all-the-icons 显示为「tofu」

   即使安装了 =all-the-icons= , mode line 等地方依然会出现 「tofu（乱码）」, 原因是使用的字体不支持 UTF-8，更换下默认字体就行

* TODO 显卡

  还未更新为 Nvida 驱动

* TODO 声卡

  genkernel 编译的内核似乎没有包含 Type-C 的声卡支持，估计需要自己手动编译下内核了

* TODO Firefox

  Firefox 时不时就会卡死，以前也遇到过，后来的解决办法是换了个浏览器?
